#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.repo will be created
  + resource "cloudflare_record" "repo" {
      + allow_overwrite = false
      + comment         = "APT repository subdomain - NOT proxied for APT client compatibility"
      + content         = "apt-bundle.github.io"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "repo"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 300
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.root will be created
  + resource "cloudflare_record" "root" {
      + allow_overwrite = false
      + comment         = "Root domain pointing to GitHub Pages for main website"
      + content         = "apt-bundle.github.io"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.www will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + comment         = "www subdomain pointing to GitHub Pages for main website"
      + content         = "apt-bundle.github.io"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + all_records        = {
      + repo = (known after apply)
      + root = (known after apply)
      + www  = (known after apply)
    }
  + repo_record        = {
      + content = "apt-bundle.github.io"
      + name    = (known after apply)
      + proxied = false
      + type    = "CNAME"
    }
  + root_domain_record = {
      + content = "apt-bundle.github.io"
      + name    = (known after apply)
      + proxied = true
      + type    = "CNAME"
    }
  + www_record         = {
      + content = "apt-bundle.github.io"
      + name    = (known after apply)
      + proxied = true
      + type    = "CNAME"
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @adeshmukh, Action: `pull_request`, Working Directory: `infra/cloudflare`, Workflow: `Terraform Plan`*